Catalogs/Сделки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>Сделки</Name>
			<Comment>Используется для обмена с УПН</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПолнойОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСделки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСделокСправочник</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаСделку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаСделку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасторженияСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервойОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУчетаСделкиПоДатеРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/СтатусыСделокСправочник.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>СтатусыСделокСправочник</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЕстьДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расторгнута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕстьСоглашениеОЗадатке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приостановлена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕстьПДКП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕстьПДИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕстьИЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезСтатуса</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Сделки/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)

	//<792882>, Басаргин (16.03.2018) {
	Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "СтатусСделки") = Перечисления.СтатусыСделокСправочник.Расторгнута
		И СтатусСделки = Перечисления.СтатусыСделокСправочник.Расторгнута Тогда
		ДополнительныеСвойства.Вставить("ОбновитьЗапросПриРасторженииСделки", Истина);	
	КонецЕсли;
	//<792882> }
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	//<792882>, Басаргин (16.03.2018) {
	Если НЕ Отказ 
		И ДополнительныеСвойства.Свойство("ОбновитьЗапросПриРасторженииСделки") 
		И ДополнительныеСвойства.ОбновитьЗапросПриРасторженииСделки Тогда
		ПараметрыЗадания = Новый Массив;
		ПараметрыЗадания.Добавить(ЗаявкаНаСделку);
		ФоновыеЗадания.Выполнить("CRMРаботаСЗаданиямиСервер.ОбновитьЗапросПриРасторженииСделки",
			ПараметрыЗадания,
			Ссылка.УникальныйИдентификатор(),
			"ОбновитьЗапросПриРасторженииСделки");			
	КонецЕсли;	
	//<792882> }
	
КонецПроцедуры
